# განმეორებადი ობიექტი, რომლის ელემენტებზე წვდომა შესაძლებელია მთელი რიცხვის ინდექსით და
# რომლის ელემენტების მთლიანი რაოდენობა (მიმდევრობის სიგრძე) შეიძლება გაიგოთ
# აადვილებს რამდენიმე კავშირის ერთდროულად მონიტორინგს და უფრო ეფექტურია,
# ვიდრე პითონში გამოკითხვის ციკლის დაწერა სოკეტის დროის ამოწურვის გამოყენებით,
# რადგან მონიტორინგი ხდება ოპერაციული სისტემის ქსელის ფენაზე და არა თარჯიმანში.


# range(stop)
range(5)
[1, 2, 3, 4]
# range(start, stop)
range(5, 10)
[5, 6, 7, 8, 9]
# range(start, stop, step)
range(0, 10, 2)
[0, 2, 4, 6, 8]
# using range() in for loop
for i in range(5):
    print(i)

# თანმიმდევრობა, რომლითაც ინდივიდუალური განცხადებები, ინსტრუქციები ან ფუნქციის გამოძახებები შესრულდება ან ფასდება.
# ver gavakete
my_name = "maxim"
password = "password is incorrect"
print(password)
number = 5
print(number)
print("number is odd")